## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64656857/runs/95b3841e-ace8-4505-b646-84789d23949e).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # launchdarkly_feature_flag.new_checkout_experience will be created
+   resource "launchdarkly_feature_flag" "new_checkout_experience" {
+       archived            = false
+       description         = "Enable the new checkout UI"
+       id                  = (known after apply)
+       include_in_snippet  = (known after apply)
+       key                 = "new-checkout-experience"
+       maintainer_id       = (known after apply)
+       maintainer_team_key = (known after apply)
+       name                = "New Checkout Experience"
+       project_key         = "my-project"
+       tags                = [
+           "checkout",
+           "managed-by-terraform",
+           "ui",
        ]
+       temporary           = false
+       variation_type      = "boolean"
+
       client_side_availability (known after apply)
+
       defaults {
+           off_variation = 1
+           on_variation  = 0
        }
+
       variations {
+           description = "The new checkout experience"
+           name        = "Enabled"
+           value       = "true"
        }
+       variations {
+           description = "The old checkout experience"
+           name        = "Disabled"
+           value       = "false"
        }
    }

  # launchdarkly_project.example will be created
+   resource "launchdarkly_project" "example" {
+       id                 = (known after apply)
+       include_in_snippet = false
+       key                = "my-project"
+       name               = "Example Project"
+       tags               = [
+           "managed-by-terraform",
        ]
+
       default_client_side_availability {
+           using_environment_id = false
+           using_mobile_key     = true
        }
+
       environments {
+           api_key              = (sensitive value)
+           client_side_id       = (sensitive value)
+           color                = "EEEEEE"
+           confirm_changes      = false
+           critical             = false
+           default_track_events = false
+           default_ttl          = 0
+           key                  = "production"
+           mobile_key           = (sensitive value)
+           name                 = "Production"
+           require_comments     = false
+           secure_mode          = false
+           tags                 = [
+               "managed-by-terraform",
            ]
+
           approval_settings (known after apply)
        }
+       environments {
+           api_key              = (sensitive value)
+           client_side_id       = (sensitive value)
+           color                = "7B42FF"
+           confirm_changes      = false
+           critical             = false
+           default_track_events = false
+           default_ttl          = 0
+           key                  = "development"
+           mobile_key           = (sensitive value)
+           name                 = "Development"
+           require_comments     = false
+           secure_mode          = false
+           tags                 = [
+               "managed-by-terraform",
            ]
+
           approval_settings (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
